# LAB 03 - Data Preprocessing 1

## #02. 데이터 구조 점검 (2)

### #01. 준비작업

In [18]:
# 1. 패키지 참조:
from hossam import load_data
from pandas import Series

In [19]:
# 2. 데이터 가져오기:
origin = load_data("grade")
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### #02. 행,열 재배치

In [20]:
# 1. 열 순서 변경: .reindex(columns = ['', '', ...]
    # 지정된 순서대로 열이 재정렬 된 결과를 반환한다
        # inplace 파라미터는 지원 안함!!
    # 원본 변화 x, 결과가 반영된 복사본 자동생성
    # 재배치 안된 열은 제외됨
        # 불필요한 열을 제거하는 용도로도 사용가능!
열순서_변경df = origin.reindex(columns = ['국어', '수학', '과학', '영어'])
열순서_변경df

    국어  수학  과학   영어
이름
철수  98  88  64   77
영희  88  62  72  120
민철  92  83  79   70
수현  63  31  71   60
호영  75  90  88   50
영호  80  91  72   88
용식  82  79  90   88
나영  90  81  95   92
석영  91  89  80   90

In [21]:
# 2. 행 순서 변경: .reindex(index = ['', '', ...]
    # 지정된 순서대로 열이 재정렬 된 결과를 반환한다
    # 원본 변화 x, 결과가 반영된 복사본 자동생성
    # 재배치 안된 열은 제외됨
행순서_변경df = origin.reindex(index = ['석영', '호영', '민철', '수현'])
행순서_변경df

    학년  성별  국어  영어  수학  과학
이름
석영   1  남자  91  90  89  80
호영   4  남자  75  50  90  88
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  71

### #03. 행,열 추가
###### 모든 경우의 수 다룸 ↓:

In [22]:
# 1. 행 추가하기: .loc['행인덱스이름'] = ['', '', ..] 
# (index 이름이 기존 것과 동일하면: 기존데이터가 수정되는 효과)

# 1) 리스트로 추가하기:
리스트_행추가df = origin.copy()
리스트_행추가df.loc['정호'] = [2, '남자', 90, 80, 70, 60]
리스트_행추가df
    # 추가할 행의 인덱스 이름 지정해야됨: '정호'
    # 리스트로 추가할 경우 DataFrame의 '컬럼 순서에 맞게' 지정해야 됨!
    # 누락되는 값 or 수 초과되면 에러뜸!

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60

In [23]:
# 1. 행 추가하기: .loc['행인덱스이름'] = {'변수이름':'값', '변수이름':'값', ..] 

# 2) 딕셔너리로 추가하기:
딕셔너리_행추가df = origin.copy()
딕셔너리_행추가df.loc['민정'] = {
    '성별': '여자',
    '학년': 4,
    '국어': 81,
    '영어': 72,
    '수학': 84,
    '과학': 90
}
딕셔너리_행추가df
    # 컬럼순서는 상관없음 ∵ 값 마다 변수이름 지정 되있으니까
    # 누락되는 값 or 수 초과되면 에러뜸

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
민정   4  여자  81   72  84  90

In [24]:
# 1. 행 추가하기:

# 3) Series 객체로 추가하기:
시리즈_행추가df = origin.copy()
s = Series(
    [2, '남자', 90, 80, 70, 60],
    index = [
        '학년', '성별', '국어', '영어', '수학', '과학'
    ]
)
시리즈_행추가df.loc['형석'] = s
시리즈_행추가df
    # 컬럼 순서 상관 없.
    # Series 객체의 index가 DataFrame의 변수명이랑 동일해야 됨

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
형석   2  남자  90   80  70  60

In [26]:
# 1. 행 추가하기: None(in Python), NaN(in Series)

# 4) '빈 값'을 저장해야 하는 경우:
빈값_행추가df = origin.copy()
s = Series(
    [2, '남자', 93, 71],
    index = [
        '학년', '성별', '국어', '수학'
    ]
)
빈값_행추가df.loc['석호'] = s
빈값_행추가df
    # Series 형태에서만 값이 없는 필드 생략 가능

    학년  성별  국어     영어  수학    과학
이름
철수   1  남자  98   77.0  88  64.0
영희   2  여자  88  120.0  62  72.0
민철   1  남자  92   70.0  83  79.0
수현   3  여자  63   60.0  31  71.0
호영   4  남자  75   50.0  90  88.0
영호   4  남자  80   88.0  91  72.0
용식   2  남자  82   88.0  79  90.0
나영   1  여자  90   92.0  81  95.0
석영   1  남자  91   90.0  89  80.0
석호   2  남자  93    NaN  71   NaN

In [27]:
# 1. 행 추가하기:

# 5) 기존 행을 '복사'해서 추가하는 경우:
행_복사df = origin.copy()
행_복사df.loc['철민'] = 행_복사df.loc['철수']
행_복사df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
철민   1  남자  98   77  88  64

In [28]:
# 1. 행 추가하기:

# 6) 단일값 추가할 때:
단일값_행추가df = origin.copy()
단일값_행추가df.loc['희영'] = 100
단일값_행추가df
    # 모든 변수에 같은 값 저장됨

     학년   성별   국어   영어   수학   과학
이름
철수    1   남자   98   77   88   64
영희    2   여자   88  120   62   72
민철    1   남자   92   70   83   79
수현    3   여자   63   60   31   71
호영    4   남자   75   50   90   88
영호    4   남자   80   88   91   72
용식    2   남자   82   88   79   90
나영    1   여자   90   92   81   95
석영    1   남자   91   90   89   80
희영  100  100  100  100  100  100

In [29]:
# 2. 열 추가하기:

# 1) 리스트로 추가하기:
리스트_열추가df = origin.copy()
리스트_열추가df['한국사'] = [72, 56, 90, None, 92, 90, 75 ,80, 60]
리스트_열추가df
    # 모든 행에 대한 값을 순서대로 나열해야 됨
    # 기존 행이랑 비교해서 값이 부족 or 초과되면 에러뜸
    # 빈값을 원하면 해당 위치에 None 명시해야됨

    학년  성별  국어   영어  수학  과학   한국사
이름
철수   1  남자  98   77  88  64  72.0
영희   2  여자  88  120  62  72  56.0
민철   1  남자  92   70  83  79  90.0
수현   3  여자  63   60  31  71   NaN
호영   4  남자  75   50  90  88  92.0
영호   4  남자  80   88  91  72  90.0
용식   2  남자  82   88  79  90  75.0
나영   1  여자  90   92  81  95  80.0
석영   1  남자  91   90  89  80  60.0

In [32]:
# 2. 열 추가하기:

# 2) 딕셔너리로 추가하기:
딕셔너리_열추가df = origin.copy()
딕셔너리_열추가df['세계사'] = {
    '철수': 90,
    '영희': 88,
    '민철': 72,
    '수현': 56,
    '호민': 65, # -> DataFrame에 없는 인덱스이므로 버림
    '용식': 77,
    '나영': 95,
    '석영': 54
}
딕셔너리_열추가df
    # 추가 안할 행은 안적으면 됨
    # 데이터프레임에 존재 안하는 인덱스는 해당 값 버림
    # 명시되지 않은 행은 빈 값(NaN)으로 설정됨

    학년  성별  국어   영어  수학  과학   세계사
이름
철수   1  남자  98   77  88  64  90.0
영희   2  여자  88  120  62  72  88.0
민철   1  남자  92   70  83  79  72.0
수현   3  여자  63   60  31  71  56.0
호영   4  남자  75   50  90  88   NaN
영호   4  남자  80   88  91  72   NaN
용식   2  남자  82   88  79  90  77.0
나영   1  여자  90   92  81  95  95.0
석영   1  남자  91   90  89  80  54.0

In [33]:
# 2. 열 추가하기:

# 3) Series 객체로 추가하기:
Series_열추가df = origin.copy()
s = Series(
    [72, 56, 90, 88],
    index = [
        '철수', '민철', '호영', '용식'
    ]
)
Series_열추가df
    # 각 값이 연결될 행의 이름(index)를 지정해야 함
    # 부분적으로 값을 비워둘 수 있다.

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [34]:
# 2. 열 추가하기:

# 4) 기존 열을 '복사'해서 추가하는 경우:
복사_열추가df = origin.copy()
복사_열추가df['체육'] = 복사_열추가df['과학']
복사_열추가df
    # 각 값이 연결될 행의 이름(index)를 지정해야 함
    # 부분적으로 값을 비워둘 수 있다.

    학년  성별  국어   영어  수학  과학  체육
이름
철수   1  남자  98   77  88  64  64
영희   2  여자  88  120  62  72  72
민철   1  남자  92   70  83  79  79
수현   3  여자  63   60  31  71  71
호영   4  남자  75   50  90  88  88
영호   4  남자  80   88  91  72  72
용식   2  남자  82   88  79  90  90
나영   1  여자  90   92  81  95  95
석영   1  남자  91   90  89  80  80

In [35]:
# 2. 열 추가하기:

# 5) 단일 값 추가하기:
단일값_열추가df = origin.copy()
단일값_열추가df['체육'] = 100
단일값_열추가df

    학년  성별  국어   영어  수학  과학   체육
이름
철수   1  남자  98   77  88  64  100
영희   2  여자  88  120  62  72  100
민철   1  남자  92   70  83  79  100
수현   3  여자  63   60  31  71  100
호영   4  남자  75   50  90  88  100
영호   4  남자  80   88  91  72  100
용식   2  남자  82   88  79  90  100
나영   1  여자  90   92  81  95  100
석영   1  남자  91   90  89  80  100

### #04. 행,열 삭제

In [43]:
# 1. 행 삭제: .drop()

# 1) 단일 행 삭제
행_삭제df = origin.copy()
행_삭제df = 행_삭제df.drop(index = '철수')
행_삭제df
    # 추가는 원본 자체가 변하지만 삭제는 결과를 반영한 복사본을 만듦!
    # .drop() 메서드도 inplace=True 파라미터 적용 가능 (but 권장안함)

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [44]:
# 1. 행 삭제

# 2) 다중 행 삭제: 삭제할 행들의 인덱스를 리스트로 지정해야됨
다중행_삭제df = origin.copy()
다중행_삭제df = 다중행_삭제df.drop(index = ['철수', '민철', '수현'])
다중행_삭제df

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [45]:
# 1. 행 삭제

# 3) index에 대한 인덱싱으로 행 삭제
인덱싱_행_삭제df = origin.copy()
인덱싱_행_삭제df.index

Index(['철수', '영희', '민철', '수현', '호영', '영호', '용식', '나영', '석영'], dtype='object', name='이름')

In [46]:
인덱싱_행_삭제결과df = 인덱싱_행_삭제df.drop(index = 인덱싱_행_삭제df.index[0])
인덱싱_행_삭제결과df

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [47]:
# 1. 행 삭제

# 4) index에 대한 '슬라이싱'으로 행 삭제
다중행_삭제df = origin.copy()
print(다중행_삭제df.index)

다중행_삭제결과df = 다중행_삭제df.drop(index = 다중행_삭제df.index[0:7])
다중행_삭제결과df

Index(['철수', '영희', '민철', '수현', '호영', '영호', '용식', '나영', '석영'], dtype='object', name='이름')

    학년  성별  국어  영어  수학  과학
이름
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

In [48]:
# 2. 열 삭제

# 1) 단일 열 삭제
단일열_삭제df = origin.copy()
단일열_삭제결과df = 단일열_삭제df.drop(columns='학년')
단일열_삭제결과df
    # 행 삭제는 .drop() 매서드에 index 파라미터를 설정하고
    # 열 삭제는 .drop() 매서드에 columns 파라미터를 설정한다

    성별  국어   영어  수학  과학
이름
철수  남자  98   77  88  64
영희  여자  88  120  62  72
민철  남자  92   70  83  79
수현  여자  63   60  31  71
호영  남자  75   50  90  88
영호  남자  80   88  91  72
용식  남자  82   88  79  90
나영  여자  90   92  81  95
석영  남자  91   90  89  80

In [49]:
# 2. 열 삭제

# 2) 다중 열 삭제
다중열_삭제df = origin.copy()
다중열_삭제결과df = 다중열_삭제df.drop(columns=['학년', '성별', '과학'])
다중열_삭제결과df
    # columns 파라미터에 리스트 타입으로 삭제할 변수 이름들 설정하기

    국어   영어  수학
이름
철수  98   77  88
영희  88  120  62
민철  92   70  83
수현  63   60  31
호영  75   50  90
영호  80   88  91
용식  82   88  79
나영  90   92  81
석영  91   90  89

In [50]:
# 2. 열 삭제

# 3) 컬럼명에 대한 인덱싱으로 열 삭제1
인덱싱_열삭제df = origin.copy()
print(인덱싱_열삭제df.columns)  # 컬럼 이름에 대한 연속성 객체

인덱싱_열삭제결과df = 인덱싱_열삭제df.drop(columns=인덱싱_열삭제df.columns[0])
인덱싱_열삭제결과df

Index(['학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

    성별  국어   영어  수학  과학
이름
철수  남자  98   77  88  64
영희  여자  88  120  62  72
민철  남자  92   70  83  79
수현  여자  63   60  31  71
호영  남자  75   50  90  88
영호  남자  80   88  91  72
용식  남자  82   88  79  90
나영  여자  90   92  81  95
석영  남자  91   90  89  80

In [51]:
# 2. 열 삭제

# 4) 컬럼명에 대한 인덱싱으로 열 삭제2
다중열_삭제df = origin.copy()
print(다중열_삭제df.columns)
다중열_삭제결과df = 다중열_삭제df.drop(columns=다중열_삭제df.columns[1:-2])
다중열_삭제결과df

Index(['학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

    학년  수학  과학
이름
철수   1  88  64
영희   2  62  72
민철   1  83  79
수현   3  31  71
호영   4  90  88
영호   4  91  72
용식   2  79  90
나영   1  81  95
석영   1  89  80